In [1]:
import pandas as pd
import matplotlib.pyplot as plt

# personal information

In [2]:
df1= pd.read_csv('abdulbaqqi_personal_information.csv')
df2= pd.read_csv('Aishat_personal_information.csv')
df3= pd.read_csv('Bisola_personal_information.csv')
df4= pd.read_csv('Oluwaferanmi_personalinfo.csv')
df5= pd.read_csv('Samuel_personal_information.csv')
df6= pd.read_csv('TheophilusPersonal Information.csv')
df7= pd.read_csv('Statesman_personal_information.csv')

In [3]:
df1

,Unnamed: 0,EMAIL,FIRST NAME,LAST NAME,LOCATION,TELEPHONE
0,1,salawuabdulbaki@gmail.com,abdulbaki,salawu,olawale yahaya bagaruwa street ilorin,9068924442

In [4]:
df1=df1.rename({'EMAIL':'E-mail', 'FIRST NAME':'First_name', 'LAST NAME':'Last_name', 'LOCATION':'Location', 'TELEPHONE':'Phone_number'}, axis='columns')
df1

,Unnamed: 0,E-mail,First_name,Last_name,Location,Phone_number
0,1,salawuabdulbaki@gmail.com,abdulbaki,salawu,olawale yahaya bagaruwa street ilorin,9068924442

In [5]:
df2

,Unnamed: 0,First name,Middle name,Surname,Address,Email,Tel
0,0,Aishat,Ayinke,Aremu,33 Issah Williams Street Apongnon,aishatmorenike1@gmail.com,7084283672

In [6]:
df2=df2.drop('Middle name', axis=1)

In [7]:
df2

,Unnamed: 0,First name,Surname,Address,Email,Tel
0,0,Aishat,Aremu,33 Issah Williams Street Apongnon,aishatmorenike1@gmail.com,7084283672

In [8]:
df2=df2.rename({'Email':'E-mail', 'First name':'First_name', 'Surname':'Last_name', 'Address':'Location', 'Tel':'Phone_number'}, axis='columns')
df2

,Unnamed: 0,First_name,Last_name,Location,E-mail,Phone_number
0,0,Aishat,Aremu,33 Issah Williams Street Apongnon,aishatmorenike1@gmail.com,7084283672

In [9]:
df3

,Unnamed: 0,Last Name,First Name,Phone Number,Location,E-mail
0,0,Bolomope,Faoziyyah,9059329620,Oyo,bisolabolomope@gmail.com

In [10]:
df3=df3.rename({'First Name':'First_name', 'Last Name':'Last_name', 'Phone Number':'Phone_number'}, axis='columns')
df3

,Unnamed: 0,Last_name,First_name,Phone_number,Location,E-mail
0,0,Bolomope,Faoziyyah,9059329620,Oyo,bisolabolomope@gmail.com

In [11]:
df4

     Last Name First Name         Tel Location                 Email
0  Ajirireloja    Michael  9076588590    Abuja  aechealgr8@gmail.com

In [12]:
df4=df4.rename({'Email':'E-mail', 'First Name':'First_name', 'Last Name':'Last_name', 'Tel':'Phone_number'}, axis='columns')
df4

     Last_name First_name  Phone_number Location                E-mail
0  Ajirireloja    Michael    9076588590    Abuja  aechealgr8@gmail.com

In [13]:
df5

,Unnamed: 0,Last_name,First_name,Phone_number,Location,E-mail
0,0,AKINLABI,Samuel,7012659092,Lagos,samueloreoluwa4@gmail.com

In [14]:
df6

,Unnamed: 0,Last name,First name,Phone number,Location,E-mail
0,0,ige,theophilus,8052085331,Lagos,igetheophilus02@gmail.com

In [15]:
df6=df6.rename({'First name':'First_name', 'Last name':'Last_name', 'Phone number':'Phone_number'}, axis='columns')
df6

,Unnamed: 0,Last_name,First_name,Phone_number,Location,E-mail
0,0,ige,theophilus,8052085331,Lagos,igetheophilus02@gmail.com

In [16]:
df7

,Unnamed: 0,Last name,First name,Phone number,Location,Email
0,0,Statesman,Oyehan Adeyinka,582556152,Dhahran,adeyinka.statesman@gmail.com

In [17]:
df7= df7.rename({'First name':'First_name', 'Last name':'Last_name', 'Phone number':'Phone_number', 'Email':'E-mail'}, axis='columns')
df7

,Unnamed: 0,Last_name,First_name,Phone_number,Location,E-mail
0,0,Statesman,Oyehan Adeyinka,582556152,Dhahran,adeyinka.statesman@gmail.com

In [18]:
pers_info= pd.concat([df1,df2,df3,df4,df5,df6,df7])

C:\Users\JHAYSU\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [19]:
pers_info

,E-mail,First_name,Last_name,Location,Phone_number,Unnamed: 0
0,salawuabdulbaki@gmail.com,abdulbaki,salawu,olawale yahaya bagaruwa street ilorin,9068924442,1.0
0,aishatmorenike1@gmail.com,Aishat,Aremu,33 Issah Williams Street Apongnon,7084283672,0.0
0,bisolabolomope@gmail.com,Faoziyyah,Bolomope,Oyo,9059329620,0.0
0,aechealgr8@gmail.com,Michael,Ajirireloja,Abuja,9076588590,NaN
0,samueloreoluwa4@gmail.com,Samuel,AKINLABI,Lagos,7012659092,0.0
0,igetheophilus02@gmail.com,theophilus,ige,Lagos,8052085331,0.0
0,adeyinka.statesman@gmail.com,Oyehan Adeyinka,Statesman,Dhahran,582556152,0.0

In [20]:
pers_info= pers_info.drop('Unnamed: 0', axis=1)

In [21]:
pers_info

,E-mail,First_name,Last_name,Location,Phone_number
0,salawuabdulbaki@gmail.com,abdulbaki,salawu,olawale yahaya bagaruwa street ilorin,9068924442
0,aishatmorenike1@gmail.com,Aishat,Aremu,33 Issah Williams Street Apongnon,7084283672
0,bisolabolomope@gmail.com,Faoziyyah,Bolomope,Oyo,9059329620
0,aechealgr8@gmail.com,Michael,Ajirireloja,Abuja,9076588590
0,samueloreoluwa4@gmail.com,Samuel,AKINLABI,Lagos,7012659092
0,igetheophilus02@gmail.com,theophilus,ige,Lagos,8052085331
0,adeyinka.statesman@gmail.com,Oyehan Adeyinka,Statesman,Dhahran,582556152

In [22]:
pers_info.to_csv('Personal_information.csv')